# 1.사람 클래스를 하나 만듭니다.
#   사람의 기본 요소는 이름, 나이, 성별로 합시다.
# 2.직장 동료 클래스를 사람 클래스를 이용해서 만듭시다.
#   사람 기본 요소 외 별도의 추가 사항은 직급입니다.
#
# 힌트
#
# 1.클래스와 상속을 활용합니다.
# 2.사람의 기본 요소인 이름, 나이, 성별은 각각 새로운 사람을 만들 때,
#   입력을 받을 수 있도록 합시다.
# 3.직장 동료의 기본 직급은 "대리"로 지정합니다.
# (고급) 사람 클래스에서 새로운 사람을 만들 때 입력은 그대로 유지하면서,
#   직급도 처음 만들어질 때 입력하도록 변경을 도전해봅시다.

class Human:
    person.name = "기욱"
    person.age = 26
    person.sex = "male"

    def __init__(self,)

    하........모르겠습니다 / 구글링해서 뒤져봣지만
    아직 class에 대한 기본개념이 세워지지않는군요. 강의를 봐야할거같아요
    2시간정도 class에 대해 찾아봣지만 뭐가 이리 어려운지 개발자꿈이 너무멀군요
    과제 2는 이렇게 마치도록하겠습니다....
